Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: فكان قاب قوسين أو أدنى
en: And was at a distance of two bow lengths or nearer.

source: فأوحى إلى عبده ما أوحى
en: And he revealed to His Servant what he revealed.

source: ما كذب الفؤاد ما رأى
en: The heart did not lie [about] what it saw.

source: أفتمارونه على ما يرى
en: So will you dispute with him over what he saw?

source: ولقد رآه نزلة أخرى
en: And he certainly saw him in another descent

source: عند سدرة المنتهى
en: At the Lote Tree of the Utmost Boundary -

source: عندها جنة المأوى
en: Near it is the Garden of Refuge -

source: إذ يغشى السدرة ما يغشى
en: When there covered the Lote Tree that which covered [it].

source: ما زاغ البصر وما طغى
en: The sight [of the Prophet] did not swerve, nor did it transgress [its limit].

source: لقد رأى من آيات ربه الكبرى
en: He certainly saw of the greatest signs of his Lord.

source: أفرأيتم اللات والعزى
en: So have you considered al-Lat and al-'Uzza?

source: ومناة الثالثة الأخرى
en: And Manat, the third - the other one?

source: ألكم الذكر وله الأنثى
en: Is the male for you and for Him the female?

source: تلك إذا قسمة ضيزى
en: That, then, is an unjust division.

source: إن هي إلا أسماء سميتموها أنتم وآباؤكم ما أنزل الله بها من سلطان إن يتبعون إلا الظن وما تهوى الأنفس ولقد جاءهم من ربهم الهدى
en: They are not but [mere] names you have named them - you and your forefathers - for which Allah has sent down no authority. They follow not except assumption and what [their] souls desire, and there has already come to them from their Lord guidance.

source: أم للإنسان ما تمنى
en: Or is there for man whatever he wishes?

source: فلله الآخرة والأولى
en: Rather, to Allah belongs the Hereafter and the first [life].

source: وكم من ملك في السماوات لا تغني شفاعتهم شيئا إلا من بعد أن يأذن الله لمن يشاء ويرضى
en: And how many angels there are in the heavens whose intercession will not avail at all except [only] after Allah has permitted [it] to whom He wills and approves.

source: إن الذين لا يؤمنون بالآخرة ليسمون الملائكة تسمية الأنثى
en: Indeed, those who do not believe in the Hereafter name the angels female names,

source: وما لهم به من علم إن يتبعون إلا الظن وإن الظن لا يغني من الحق شيئا
en: And they have thereof no knowledge. They follow not except assumption, and indeed, assumption avails not against the truth at all.

source: فأعرض عن من تولى عن ذكرنا ولم يرد إلا الحياة الدنيا
en: So turn away from whoever turns his back on Our message and desires not except the worldly life.

source: ذلك مبلغهم من العلم إن ربك هو أعلم بمن ضل عن سبيله وهو أعلم بمن اهتدى
en: That is their sum of knowledge. Indeed, your Lord is most knowing of who strays from His way, and He is most knowing of who is guided.

source: ولله ما في السماوات وما في الأرض ليجزي الذين أساءوا بما عملوا ويجزي الذين أحسنوا بالحسنى
en: And to Allah belongs whatever is in the heavens and whatever is in the earth - that He may recompense those who do evil with [the penalty of] what they have done and recompense those who do good with the best [reward] -

source: الذين يجتنبون كبائر الإثم والفواحش إلا اللمم إن ربك واسع المغفرة هو أعلم بكم إذ أنشأكم من الأرض وإذ أنتم أجنة في بطون أمهاتكم فلا تزكوا أنفسكم هو أعلم بمن اتقى
en: Those who avoid the major sins and immoralities, only [committing] slight ones. Indeed, your Lord is vast in forgiveness. He was most knowing of you when He produced you from the earth and when you were fetuses in the wombs of your mothers. So do not claim yourselves to be pure; He is most knowing of who fears Him.

source: أفرأيت الذي تولى
en: Have you seen the one who turned away

source: وأعطى قليلا وأكدى
en: And gave a little and [then] refrained?

source: أعنده علم الغيب فهو يرى
en: Does he have knowledge of the unseen, so he sees?

source: أم لم ينبأ بما في صحف موسى
en: Or has he not been informed of what was in the scriptures of Moses

source: وإبراهيم الذي وفى
en: And [of] Abraham, who fulfilled [his obligations] -

source: ألا تزر وازرة وزر أخرى
en: That no bearer of burdens will bear the burden of another

source: وأن ليس للإنسان إلا ما سعى
en: And that there is not for man except that [good] for which he strives

source: وأن سعيه سوف يرى
en: And that his effort is going to be seen -

source: ثم يجزاه الجزاء الأوفى
en: Then he will be recompensed for it with the fullest recompense

source: وأن إلى ربك المنتهى
en: And that to your Lord is the finality

source: وأنه هو أضحك وأبكى
en: And that it is He who makes [one] laugh and weep

source: وأنه هو أمات وأحيا
en: And that it is He who causes death and gives life

source: وأنه خلق الزوجين الذكر والأنثى
en: And that He creates the two mates - the male and female -

source: من نطفة إذا تمنى
en: From a sperm-drop when it is emitted

source: وأن عليه النشأة الأخرى
en: And that [incumbent] upon Him is the next creation

source: وأنه هو أغنى وأقنى
en: And that it is He who enriches and suffices

source: وأنه هو رب الشعرى
en: And that it is He who is the Lord of Sirius

source: وأنه أهلك عادا الأولى
en: And that He destroyed the first [people of] 'Aad

source: وثمود فما أبقى
en: And Thamud - and He did not spare [them] -

source: وقوم نوح من قبل إنهم كانوا هم أظلم وأطغى
en: And the people of Noah before. Indeed, it was they who were [even] more unjust and oppressing.

source: والمؤتفكة أهوى
en: And the overturned towns He hurled down

source: فغشاها ما غشى
en: And covered them by that which He covered.

source: فبأي آلاء ربك تتمارى
en: Then which of the favors of your Lord do you doubt?

source: هذا نذير من النذر الأولى
en: This [Prophet] is a warner like the former warners.

source: أزفت الآزفة
en: The Approaching Day has approached.

source: ليس لها من دون الله كاشفة
en: Of it, [from those] besides Allah, there is no remover.

source: أفمن هذا الحديث تعجبون
en: Then at this statement do you wonder?

source: وتضحكون ولا تبكون
en: And you laugh and do not weep

source: وأنتم سامدون
en: While you are proudly sporting?

source: فاسجدوا لله واعبدوا
en: So prostrate to Allah and worship [Him].

source: اقتربت الساعة وانشق القمر
en: The Hour has come near, and the moon has split [in two].

source: وإن يروا آية يعرضوا ويقولوا سحر مستمر
en: And if they see a miracle, they turn away and say, "Passing magic."

source: وكذبوا واتبعوا أهواءهم وكل أمر مستقر
en: And they denied and followed their inclinations. But for every matter is a [time of] settlement.

source: ولقد جاءهم من الأنباء ما فيه مزدجر
en: And there has already come to them of information that in which there is deterrence -

source: حكمة بالغة فما تغن النذر
en: Extensive wisdom - but warning does not avail [them].

source: فتول عنهم يوم يدع الداع إلى شيء نكر
en: So leave them, [O Muhammad]. The Day the Caller calls to something forbidding,

source: خشعا أبصارهم يخرجون من الأجداث كأنهم جراد منتشر
en: Their eyes humbled, they will emerge from the graves as if they were locusts spreading,

source: مهطعين إلى الداع يقول الكافرون هذا يوم عسر
en: Racing ahead toward the Caller. The disbelievers will say, "This is a difficult Day."

source: كذبت قبلهم قوم نوح فكذبوا عبدنا وقالوا مجنون وازدجر
en: The people of Noah denied before them, and they denied Our servant and said, "A madman," and he was repelled.

source: فدعا ربه أني مغلوب فانتصر
en: So he invoked his Lord, "Indeed, I am overpowered, so help."

source: ففتحنا أبواب السماء بماء منهمر
en: Then We opened the gates of the heaven with rain pouring down

source: وفجرنا الأرض عيونا فالتقى الماء على أمر قد قدر
en: And caused the earth to burst with springs, and the waters met for a matter already predestined.

source: وحملناه على ذات ألواح ودسر
en: And We carried him on a [construction of] planks and nails,

source: تجري بأعيننا جزاء لمن كان كفر
en: Sailing under Our observation as reward for he who had been denied.

source: ولقد تركناها آية فهل من مدكر
en: And We left it as a sign, so is there any who will remember?

source: فكيف كان عذابي ونذر
en: And how [severe] were My punishment and warning.

source: ولقد يسرنا القرآن للذكر فهل من مدكر
en: And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?

source: كذبت عاد فكيف كان عذابي ونذر
en: 'Aad denied; and how [severe] were My punishment and warning.

source: إنا أرسلنا عليهم ريحا صرصرا في يوم نحس مستمر
en: Indeed, We sent upon them a screaming wind on a day of continuous misfortune,

source: تنزع الناس كأنهم أعجاز نخل منقعر
en: Extracting the people as if they were trunks of palm trees uprooted.

source: كذبت ثمود بالنذر
en: Thamud denied the warning

source: فقالوا أبشرا منا واحدا نتبعه إنا إذا لفي ضلال وسعر
en: And said, "Is it one human being among us that we should follow? Indeed, we would then be in error and madness.

source: أألقي الذكر عليه من بيننا بل هو كذاب أشر
en: Has the message been sent down upon him from among us? Rather, he is an insolent liar."

source: سيعلمون غدا من الكذاب الأشر
en: They will know tomorrow who is the insolent liar.

source: إنا مرسلو الناقة فتنة لهم فارتقبهم واصطبر
en: Indeed, We are sending the she-camel as trial for them, so watch them and be patient.

source: ونبئهم أن الماء قسمة بينهم كل شرب محتضر
en: And inform them that the water is shared between them, each [day of] drink attended [by turn].

source: فنادوا صاحبهم فتعاطى فعقر
en: But they called their companion, and he dared and hamstrung [her].

source: إنا أرسلنا عليهم صيحة واحدة فكانوا كهشيم المحتظر
en: Indeed, We sent upon them one blast from the sky, and they became like the dry twig fragments of an [animal] pen.

source: كذبت قوم لوط بالنذر
en: The people of Lot denied the warning.

source: إنا أرسلنا عليهم حاصبا إلا آل لوط نجيناهم بسحر
en: Indeed, We sent upon them a storm of stones, except the family of Lot - We saved them before dawn

source: نعمة من عندنا كذلك نجزي من شكر
en: As favor from us. Thus do We reward he who is grateful.

source: ولقد أنذرهم بطشتنا فتماروا بالنذر
en: And he had already warned them of Our assault, but they disputed the warning.

source: ولقد راودوه عن ضيفه فطمسنا أعينهم فذوقوا عذابي ونذر
en: And they had demanded from him his guests, but We obliterated their eyes, [saying], "Taste My punishment and warning."

source: ولقد صبحهم بكرة عذاب مستقر
en: And there came upon them by morning an abiding punishment.

source: فذوقوا عذابي ونذر
en: So taste My punishment and warning.

source: ولقد جاء آل فرعون النذر
en: And there certainly came to the people of Pharaoh warning.

source: كذبوا بآياتنا كلها فأخذناهم أخذ عزيز مقتدر
en: They denied Our signs, all of them, so We seized them with a seizure of one Exalted in Might and Perfect in Ability.

source: أكفاركم خير من أولئكم أم لكم براءة في الزبر
en: Are your disbelievers better than those [former ones], or have you immunity in the scripture?

source: أم يقولون نحن جميع منتصر
en: Or do they say, "We are an assembly supporting [each other]"?

source: سيهزم الجمع ويولون الدبر
en: [Their] assembly will be defeated, and they will turn their backs [in retreat].

source: بل الساعة موعدهم والساعة أدهى وأمر
en: But the Hour is their appointment [for due punishment], and the Hour is more disastrous and more bitter.

source: إن المجرمين في ضلال وسعر
en: Indeed, the criminals are in error and madness.

source: يوم يسحبون في النار على وجوههم ذوقوا مس سقر
en: The Day they are dragged into the Fire on their faces [it will be said], "Taste the touch of Saqar."

source: إنا كل شيء خلقناه بقدر
en: Indeed, all things We created with predestination.

source: وما أمرنا إلا واحدة كلمح بالبصر
en: And Our command is but one, like a glance of the eye.

source: ولقد أهلكنا أشياعكم فهل من مدكر
en: And We have already destroyed your kinds, so is there any who will remember?

source: وكل شيء فعلوه في الزبر
en: And everything they did is in written records.

source: وكل صغير وكبير مستطر
en: And every small and great [thing] is inscribed.

source: إن المتقين في جنات ونهر
en: Indeed, the righteous will be among gardens and rivers,

source: في مقعد صدق عند مليك مقتدر
en: In a seat of honor near a Sovereign, Perfect in Ability.

source: الرحمن
en: The Most Merciful

source: علم القرآن
en: Taught the Qur'an,

source: خلق الإنسان
en: Created man,

source: علمه البيان
en: [And] taught him eloquence.

source: الشمس والقمر بحسبان
en: The sun and the moon [move] by precise calculation,

source: والنجم والشجر يسجدان
en: And the stars and trees prostrate.

source: والسماء رفعها ووضع الميزان
en: And the heaven He raised and imposed the balance

source: ألا تطغوا في الميزان
en: That you not transgress within the balance.

source: وأقيموا الوزن بالقسط ولا تخسروا الميزان
en: And establish weight in justice and do not make deficient the balance.

source: والأرض وضعها للأنام
en: And the earth He laid [out] for the creatures.

source: فيها فاكهة والنخل ذات الأكمام
en: Therein is fruit and palm trees having sheaths [of dates]

source: والحب ذو العصف والريحان
en: And grain having husks and scented plants.

source: فبأي آلاء ربكما تكذبان
en: So which of the favors of your Lord would you deny?

source: خلق الإنسان من صلصال كالفخار
en: He created man from clay like [that of] pottery.

source: وخلق الجان من مارج من نار
en: And He created the jinn from a smokeless flame of fire.

source: رب المشرقين ورب المغربين
en: [He is] Lord of the two sunrises and Lord of the two sunsets.

source: مرج البحرين يلتقيان
en: He released the two seas, meeting [side by side];

source: بينهما برزخ لا يبغيان
en: Between them is a barrier [so] neither of them transgresses.

source: يخرج منهما اللؤلؤ والمرجان
en: From both of them emerge pearl and coral.

source: وله الجوار المنشآت في البحر كالأعلام
en: And to Him belong the ships [with sails] elevated in the sea like mountains.

source: كل من عليها فان
en: Everyone upon the earth will perish,

source: ويبقى وجه ربك ذو الجلال والإكرام
en: And there will remain the Face of your Lord, Owner of Majesty and Honor.

source: يسأله من في السماوات والأرض كل يوم هو في شأن
en: Whoever is within the heavens and earth asks Him; every day He is bringing about a matter.

source: سنفرغ لكم أيه الثقلان
en: We will attend to you, O prominent beings.

source: يا معشر الجن والإنس إن استطعتم أن تنفذوا من أقطار السماوات والأرض فانفذوا لا تنفذون إلا بسلطان
en: O company of jinn and mankind, if you are able to pass beyond the regions of the heavens and the earth, then pass. You will not pass except by authority [from Allah].

source: يرسل عليكما شواظ من نار ونحاس فلا تنتصران
en: There will be sent upon you a flame of fire and smoke, and you will not defend yourselves.

source: فإذا انشقت السماء فكانت وردة كالدهان
en: And when the heaven is split open and becomes rose-colored like oil -

source: فيومئذ لا يسأل عن ذنبه إنس ولا جان
en: Then on that Day none will be asked about his sin among men or jinn.

source: يعرف المجرمون بسيماهم فيؤخذ بالنواصي والأقدام
en: The criminals will be known by their marks, and they will be seized by the forelocks and the feet.

source: هذه جهنم التي يكذب بها المجرمون
en: This is Hell, which the criminals deny.

source: يطوفون بينها وبين حميم آن
en: They will go around between it and scalding water, heated [to the utmost degree].

source: ولمن خاف مقام ربه جنتان
en: But for he who has feared the position of his Lord are two gardens -

source: ذواتا أفنان
en: Having [spreading] branches.

source: فيهما عينان تجريان
en: In both of them are two springs, flowing.

source: فيهما من كل فاكهة زوجان
en: In both of them are of every fruit, two kinds.

source: متكئين على فرش بطائنها من إستبرق وجنى الجنتين دان
en: [They are] reclining on beds whose linings are of silk brocade, and the fruit of the two gardens is hanging low.

source: فيهن قاصرات الطرف لم يطمثهن إنس قبلهم ولا جان
en: In them are women limiting [their] glances, untouched before them by man or jinni -

source: كأنهن الياقوت والمرجان
en: As if they were rubies and coral.

source: هل جزاء الإحسان إلا الإحسان
en: Is the reward for good [anything] but good?

source: ومن دونهما جنتان
en: And below them both [in excellence] are two [other] gardens -

source: مدهامتان
en: Dark green [in color].

source: فيهما عينان نضاختان
en: In both of them are two springs, spouting.

source: فيهما فاكهة ونخل ورمان
en: In both of them are fruit and palm trees and pomegranates.

source: فيهن خيرات حسان
en: In them are good and beautiful women -

source: حور مقصورات في الخيام
en: Fair ones reserved in pavilions -

source: لم يطمثهن إنس قبلهم ولا جان
en: Untouched before them by man or jinni -

source: متكئين على رفرف خضر وعبقري حسان
en: Reclining on green cushions and beautiful fine carpets.

source: تبارك اسم ربك ذي الجلال والإكرام
en: Blessed is the name of your Lord, Owner of Majesty and Honor.

source: إذا وقعت الواقعة
en: When the Occurrence occurs,

source: ليس لوقعتها كاذبة
en: There is, at its occurrence, no denial.

source: خافضة رافعة
en: It will bring down [some] and raise up [others].

source: إذا رجت الأرض رجا
en: When the earth is shaken with convulsion

source: وبست الجبال بسا
en: And the mountains are broken down, crumbling

source: فكانت هباء منبثا
en: And become dust dispersing.

source: وكنتم أزواجا ثلاثة
en: And you become [of] three kinds:

source: فأصحاب الميمنة ما أصحاب الميمنة
en: Then the companions of the right - what are the companions of the right?

source: وأصحاب المشأمة ما أصحاب المشأمة
en: And the companions of the left - what are the companions of the left?

source: والسابقون السابقون
en: And the forerunners, the forerunners -

source: أولئك المقربون
en: Those are the ones brought near [to Allah]

source: ثلة من الأولين
en: A [large] company of the former peoples

source: وقليل من الآخرين
en: And a few of the later peoples,

source: على سرر موضونة
en: On thrones woven [with ornament],

source: متكئين عليها متقابلين
en: Reclining on them, facing each other.

source: يطوف عليهم ولدان مخلدون
en: There will circulate among them young boys made eternal

source: بأكواب وأباريق وكأس من معين
en: With vessels, pitchers and a cup [of wine] from a flowing spring -

source: لا يصدعون عنها ولا ينزفون
en: No headache will they have therefrom, nor will they be intoxicated -

source: وفاكهة مما يتخيرون
en: And fruit of what they select

source: ولحم طير مما يشتهون
en: And the meat of fowl, from whatever they desire.

source: وحور عين
en: And [for them are] fair women with large, [beautiful] eyes,

source: كأمثال اللؤلؤ المكنون
en: The likenesses of pearls well-protected,

source: جزاء بما كانوا يعملون
en: As reward for what they used to do.

source: لا يسمعون فيها لغوا ولا تأثيما
en: They will not hear therein ill speech or commission of sin -

source: إلا قيلا سلاما سلاما
en: Only a saying: "Peace, peace."

source: وأصحاب اليمين ما أصحاب اليمين
en: The companions of the right - what are the companions of the right?

source: في سدر مخضود
en: [They will be] among lote trees with thorns removed

source: وطلح منضود
en: And [banana] trees layered [with fruit]

source: وظل ممدود
en: And shade extended

source: وماء مسكوب
en: And water poured out

source: وفاكهة كثيرة
en: And fruit, abundant [and varied],

source: لا مقطوعة ولا ممنوعة
en: Neither limited [to season] nor forbidden,

source: وفرش مرفوعة
en: And [upon] beds raised high.

source: إنا أنشأناهن إنشاء
en: Indeed, We have produced the women of Paradise in a [new] creation

source: فجعلناهن أبكارا
en: And made them virgins,

source: عربا أترابا
en: Devoted [to their husbands] and of equal age,

source: لأصحاب اليمين
en: For the companions of the right [who are]

source: وثلة من الآخرين
en: And a company of the later peoples.

source: وأصحاب الشمال ما أصحاب الشمال
en: And the companions of the left - what are the companions of the left?

source: في سموم وحميم
en: [They will be] in scorching fire and scalding water

source: وظل من يحموم
en: And a shade of black smoke,

source: لا بارد ولا كريم
en: Neither cool nor beneficial.

source: إنهم كانوا قبل ذلك مترفين
en: Indeed they were, before that, indulging in affluence,

source: وكانوا يصرون على الحنث العظيم
en: And they used to persist in the great violation,

source: وكانوا يقولون أئذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: And they used to say, "When we die and become dust and bones, are we indeed to be resurrected?

source: قل إن الأولين والآخرين
en: Say, [O Muhammad], "Indeed, the former and the later peoples

source: لمجموعون إلى ميقات يوم معلوم
en: Are to be gathered together for the appointment of a known Day."

source: ثم إنكم أيها الضالون المكذبون
en: Then indeed you, O those astray [who are] deniers,

source: لآكلون من شجر من زقوم
en: Will be eating from trees of zaqqum

source: فمالئون منها البطون
en: And filling with it your bellies

source: فشاربون عليه من الحميم
en: And drinking on top of it from scalding water

source: فشاربون شرب الهيم
en: And will drink as the drinking of thirsty camels.

source: هذا نزلهم يوم الدين
en: That is their accommodation on the Day of Recompense.

source: نحن خلقناكم فلولا تصدقون
en: We have created you, so why do you not believe?

source: أفرأيتم ما تمنون
en: Have you seen that which you emit?

source: أأنتم تخلقونه أم نحن الخالقون
en: Is it you who creates it, or are We the Creator?

source: نحن قدرنا بينكم الموت وما نحن بمسبوقين
en: We have decreed death among you, and We are not to be outdone

source: على أن نبدل أمثالكم وننشئكم في ما لا تعلمون
en: In that We will change your likenesses and produce you in that [form] which you do not know.

source: ولقد علمتم النشأة الأولى فلولا تذكرون
en: And you have already known the first creation, so will you not remember?

source: أفرأيتم ما تحرثون
en: And have you seen that [seed] which you sow?

source: أأنتم تزرعونه أم نحن الزارعون
en: Is it you who makes it grow, or are We the grower?

source: لو نشاء لجعلناه حطاما فظلتم تفكهون
en: If We willed, We could make it [dry] debris, and you would remain in wonder,

source: إنا لمغرمون
en: [Saying], "Indeed, we are [now] in debt;

source: بل نحن محرومون
en: Rather, we have been deprived."

source: أفرأيتم الماء الذي تشربون
en: And have you seen the water that you drink?

source: أأنتم أنزلتموه من المزن أم نحن المنزلون
en: Is it you who brought it down from the clouds, or is it We who bring it down?

source: لو نشاء جعلناه أجاجا فلولا تشكرون
en: If We willed, We could make it bitter, so why are you not grateful?

source: أفرأيتم النار التي تورون
en: And have you seen the fire that you ignite?

source: أأنتم أنشأتم شجرتها أم نحن المنشئون
en: Is it you who produced its tree, or are We the producer?

source: نحن جعلناها تذكرة ومتاعا للمقوين
en: We have made it a reminder and provision for the travelers,

source: فسبح باسم ربك العظيم
en: So exalt the name of your Lord, the Most Great.

source: فلا أقسم بمواقع النجوم
en: Then I swear by the setting of the stars,

source: وإنه لقسم لو تعلمون عظيم
en: And indeed, it is an oath - if you could know - [most] great.

source: إنه لقرآن كريم
en: Indeed, it is a noble Qur'an

source: في كتاب مكنون
en: In a Register well-protected;

source: لا يمسه إلا المطهرون
en: None touch it except the purified.

source: تنزيل من رب العالمين
en: [It is] a revelation from the Lord of the worlds.

source: أفبهذا الحديث أنتم مدهنون
en: Then is it to this statement that you are indifferent

source: وتجعلون رزقكم أنكم تكذبون
en: And make [the thanks for] your provision that you deny [the Provider]?

source: فلولا إذا بلغت الحلقوم
en: Then why, when the soul at death reaches the throat

source: وأنتم حينئذ تنظرون
en: And you are at that time looking on -

source: ونحن أقرب إليه منكم ولكن لا تبصرون
en: And Our angels are nearer to him than you, but you do not see -

source: فلولا إن كنتم غير مدينين
en: Then why do you not, if you are not to be recompensed,

source: ترجعونها إن كنتم صادقين
en: Bring it back, if you should be truthful?

source: فأما إن كان من المقربين
en: And if the deceased was of those brought near to Allah,

source: فروح وريحان وجنت نعيم
en: Then [for him is] rest and bounty and a garden of pleasure.
